; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))

  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))

  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (and (calibrated ?i)))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (and (have_image ?d ?m))))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	satellite1 - satellite
	instrument2 - instrument
	satellite2 - satellite
	instrument3 - instrument
	instrument4 - instrument
	instrument5 - instrument
	satellite3 - satellite
	instrument6 - instrument
	satellite4 - satellite
	instrument7 - instrument
	instrument8 - instrument
	instrument9 - instrument
	spectrograph1 - mode
	infrared2 - mode
	infrared0 - mode
	thermograph4 - mode
	image3 - mode
	Star0 - direction
	GroundStation1 - direction
	GroundStation2 - direction
	Star4 - direction
	Star3 - direction
	Planet5 - direction
	Planet6 - direction
	Star7 - direction
	Star8 - direction
	Star9 - direction
	Planet10 - direction
	Phenomenon11 - direction
	Planet12 - direction
	Star13 - direction
	Phenomenon14 - direction
	Star15 - direction
	Star16 - direction
	Phenomenon17 - direction
	Phenomenon18 - direction
	Phenomenon19 - direction
	Planet20 - direction
	Phenomenon21 - direction
	Planet22 - direction
	Star23 - direction
	Planet24 - direction
	Planet25 - direction
	Phenomenon26 - direction
	Star27 - direction
	Phenomenon28 - direction
	Star29 - direction
)
(:init
	(supports instrument0 infrared2)
	(calibration_target instrument0 GroundStation2)
	(supports instrument1 infrared2)
	(calibration_target instrument1 GroundStation1)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Planet10)
	(supports instrument2 spectrograph1)
	(supports instrument2 thermograph4)
	(calibration_target instrument2 Star0)
	(on_board instrument2 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Planet22)
	(supports instrument3 image3)
	(supports instrument3 infrared0)
	(supports instrument3 infrared2)
	(calibration_target instrument3 GroundStation1)
	(supports instrument4 spectrograph1)
	(supports instrument4 infrared0)
	(calibration_target instrument4 Star4)
	(supports instrument5 thermograph4)
	(supports instrument5 infrared2)
	(supports instrument5 spectrograph1)
	(calibration_target instrument5 GroundStation1)
	(on_board instrument3 satellite2)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star7)
	(supports instrument6 infrared2)
	(supports instrument6 image3)
	(supports instrument6 thermograph4)
	(calibration_target instrument6 GroundStation2)
	(on_board instrument6 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star13)
	(supports instrument7 infrared0)
	(supports instrument7 spectrograph1)
	(calibration_target instrument7 Star3)
	(supports instrument8 infrared2)
	(supports instrument8 thermograph4)
	(calibration_target instrument8 Star4)
	(supports instrument9 image3)
	(supports instrument9 thermograph4)
	(supports instrument9 infrared0)
	(calibration_target instrument9 Star3)
	(on_board instrument7 satellite4)
	(on_board instrument8 satellite4)
	(on_board instrument9 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon26)
)
(:goal (and
	(pointing satellite2 Phenomenon26)
	(pointing satellite3 Phenomenon26)
	(have_image Planet5 thermograph4)
	(have_image Planet6 infrared0)
	(have_image Star7 spectrograph1)
	(have_image Star8 infrared0)
	(have_image Star9 infrared2)
	(have_image Planet10 infrared0)
	(have_image Phenomenon11 thermograph4)
	(have_image Planet12 infrared2)
	(have_image Star13 thermograph4)
	(have_image Phenomenon14 thermograph4)
	(have_image Star15 image3)
	(have_image Star16 spectrograph1)
	(have_image Phenomenon17 spectrograph1)
	(have_image Phenomenon18 spectrograph1)
	(have_image Phenomenon19 spectrograph1)
	(have_image Phenomenon21 thermograph4)
	(have_image Planet22 thermograph4)
	(have_image Star23 infrared2)
	(have_image Planet24 thermograph4)
	(have_image Planet25 infrared2)
	(have_image Phenomenon26 infrared2)
	(have_image Star27 spectrograph1)
	(have_image Phenomenon28 infrared0)
	(have_image Star29 thermograph4)
))

)

; plan
1. (switch_on instrument7 satellite4)
   deleted: (power_avail satellite4)
   added: (power_on instrument7)
   goals met: 0 of 26
2. (switch_on instrument6 satellite3)
   deleted: (power_avail satellite3)
   added: (power_on instrument6)
   goals met: 0 of 26
3. (turn_to satellite4 phenomenon17 phenomenon26)
   deleted: (pointing satellite4 phenomenon26)
   added: (pointing satellite4 phenomenon17)
   goals met: 0 of 26
4. (turn_to satellite4 star3 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 star3)
   goals met: 0 of 26
5. (calibrate satellite4 instrument7 star3)
   added: (calibrated instrument7)
   goals met: 0 of 26
6. (turn_to satellite4 phenomenon17 star3)
   deleted: (pointing satellite4 star3)
   added: (pointing satellite4 phenomenon17)
   goals met: 0 of 26
7. (take_image satellite4 phenomenon17 instrument7 spectrograph1)
   added: (have_image phenomenon17 spectrograph1)
   goals met: 1 of 26
8. (turn_to satellite4 phenomenon18 phenomenon17)
   deleted: (pointing satellite4 phenomenon17)
   added: (pointing satellite4 phenomenon18)
   goals met: 1 of 26
9. (take_image satellite4 phenomenon18 instrument7 spectrograph1)
   added: (have_image phenomenon18 spectrograph1)
   goals met: 2 of 26
10. (turn_to satellite4 phenomenon19 phenomenon18)
   deleted: (pointing satellite4 phenomenon18)
   added: (pointing satellite4 phenomenon19)
   goals met: 2 of 26
11. (take_image satellite4 phenomenon19 instrument7 spectrograph1)
   added: (have_image phenomenon19 spectrograph1)
   goals met: 3 of 26
12. (turn_to satellite4 phenomenon28 phenomenon19)
   deleted: (pointing satellite4 phenomenon19)
   added: (pointing satellite4 phenomenon28)
   goals met: 3 of 26
13. (take_image satellite4 phenomenon28 instrument7 infrared0)
   added: (have_image phenomenon28 infrared0)
   goals met: 4 of 26
14. (turn_to satellite4 planet10 phenomenon28)
   deleted: (pointing satellite4 phenomenon28)
   added: (pointing satellite4 planet10)
   goals met: 4 of 26
15. (take_image satellite4 planet10 instrument7 infrared0)
   added: (have_image planet10 infrared0)
   goals met: 5 of 26
16. (turn_to satellite4 planet6 planet10)
   deleted: (pointing satellite4 planet10)
   added: (pointing satellite4 planet6)
   goals met: 5 of 26
17. (take_image satellite4 planet6 instrument7 infrared0)
   added: (have_image planet6 infrared0)
   goals met: 6 of 26
18. (turn_to satellite4 star16 planet6)
   deleted: (pointing satellite4 planet6)
   added: (pointing satellite4 star16)
   goals met: 6 of 26
19. (take_image satellite4 star16 instrument7 spectrograph1)
   added: (have_image star16 spectrograph1)
   goals met: 7 of 26
20. (turn_to satellite4 star27 star16)
   deleted: (pointing satellite4 star16)
   added: (pointing satellite4 star27)
   goals met: 7 of 26
21. (take_image satellite4 star27 instrument7 spectrograph1)
   added: (have_image star27 spectrograph1)
   goals met: 8 of 26
22. (turn_to satellite4 star7 star27)
   deleted: (pointing satellite4 star27)
   added: (pointing satellite4 star7)
   goals met: 8 of 26
23. (take_image satellite4 star7 instrument7 spectrograph1)
   added: (have_image star7 spectrograph1)
   goals met: 9 of 26
24. (turn_to satellite4 star8 star7)
   deleted: (pointing satellite4 star7)
   added: (pointing satellite4 star8)
   goals met: 9 of 26
25. (take_image satellite4 star8 instrument7 infrared0)
   added: (have_image star8 infrared0)
   goals met: 10 of 26
26. (turn_to satellite3 groundstation2 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 groundstation2)
   goals met: 10 of 26
27. (calibrate satellite3 instrument6 groundstation2)
   added: (calibrated instrument6)
   goals met: 10 of 26
28. (turn_to satellite3 phenomenon11 groundstation2)
   deleted: (pointing satellite3 groundstation2)
   added: (pointing satellite3 phenomenon11)
   goals met: 10 of 26
29. (take_image satellite3 phenomenon11 instrument6 thermograph4)
   added: (have_image phenomenon11 thermograph4)
   goals met: 11 of 26
30. (turn_to satellite3 phenomenon14 phenomenon11)
   deleted: (pointing satellite3 phenomenon11)
   added: (pointing satellite3 phenomenon14)
   goals met: 11 of 26
31. (take_image satellite3 phenomenon14 instrument6 thermograph4)
   added: (have_image phenomenon14 thermograph4)
   goals met: 12 of 26
32. (turn_to satellite3 phenomenon21 phenomenon14)
   deleted: (pointing satellite3 phenomenon14)
   added: (pointing satellite3 phenomenon21)
   goals met: 12 of 26
33. (take_image satellite3 phenomenon21 instrument6 thermograph4)
   added: (have_image phenomenon21 thermograph4)
   goals met: 13 of 26
34. (turn_to satellite3 phenomenon26 phenomenon21)
   deleted: (pointing satellite3 phenomenon21)
   added: (pointing satellite3 phenomenon26)
   goals met: 14 of 26
35. (take_image satellite3 phenomenon26 instrument6 infrared2)
   added: (have_image phenomenon26 infrared2)
   goals met: 15 of 26
36. (turn_to satellite2 phenomenon26 star7)
   deleted: (pointing satellite2 star7)
   added: (pointing satellite2 phenomenon26)
   goals met: 16 of 26
37. (turn_to satellite3 planet12 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 planet12)
   goals met: 15 of 26
38. (take_image satellite3 planet12 instrument6 infrared2)
   added: (have_image planet12 infrared2)
   goals met: 16 of 26
39. (turn_to satellite3 phenomenon26 planet12)
   deleted: (pointing satellite3 planet12)
   added: (pointing satellite3 phenomenon26)
   goals met: 17 of 26
40. (turn_to satellite3 planet22 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 planet22)
   goals met: 16 of 26
41. (take_image satellite3 planet22 instrument6 thermograph4)
   added: (have_image planet22 thermograph4)
   goals met: 17 of 26
42. (turn_to satellite3 phenomenon26 planet22)
   deleted: (pointing satellite3 planet22)
   added: (pointing satellite3 phenomenon26)
   goals met: 18 of 26
43. (turn_to satellite3 planet24 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 planet24)
   goals met: 17 of 26
44. (take_image satellite3 planet24 instrument6 thermograph4)
   added: (have_image planet24 thermograph4)
   goals met: 18 of 26
45. (turn_to satellite3 phenomenon26 planet24)
   deleted: (pointing satellite3 planet24)
   added: (pointing satellite3 phenomenon26)
   goals met: 19 of 26
46. (turn_to satellite3 planet25 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 planet25)
   goals met: 18 of 26
47. (take_image satellite3 planet25 instrument6 infrared2)
   added: (have_image planet25 infrared2)
   goals met: 19 of 26
48. (turn_to satellite3 phenomenon26 planet25)
   deleted: (pointing satellite3 planet25)
   added: (pointing satellite3 phenomenon26)
   goals met: 20 of 26
49. (turn_to satellite3 planet5 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 planet5)
   goals met: 19 of 26
50. (take_image satellite3 planet5 instrument6 thermograph4)
   added: (have_image planet5 thermograph4)
   goals met: 20 of 26
51. (turn_to satellite3 phenomenon26 planet5)
   deleted: (pointing satellite3 planet5)
   added: (pointing satellite3 phenomenon26)
   goals met: 21 of 26
52. (turn_to satellite3 star13 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 star13)
   goals met: 20 of 26
53. (take_image satellite3 star13 instrument6 thermograph4)
   added: (have_image star13 thermograph4)
   goals met: 21 of 26
54. (turn_to satellite3 phenomenon26 star13)
   deleted: (pointing satellite3 star13)
   added: (pointing satellite3 phenomenon26)
   goals met: 22 of 26
55. (turn_to satellite3 star15 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 star15)
   goals met: 21 of 26
56. (take_image satellite3 star15 instrument6 image3)
   added: (have_image star15 image3)
   goals met: 22 of 26
57. (turn_to satellite3 phenomenon26 star15)
   deleted: (pointing satellite3 star15)
   added: (pointing satellite3 phenomenon26)
   goals met: 23 of 26
58. (turn_to satellite3 star23 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 star23)
   goals met: 22 of 26
59. (take_image satellite3 star23 instrument6 infrared2)
   added: (have_image star23 infrared2)
   goals met: 23 of 26
60. (turn_to satellite3 phenomenon26 star23)
   deleted: (pointing satellite3 star23)
   added: (pointing satellite3 phenomenon26)
   goals met: 24 of 26
61. (turn_to satellite3 star29 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 star29)
   goals met: 23 of 26
62. (take_image satellite3 star29 instrument6 thermograph4)
   added: (have_image star29 thermograph4)
   goals met: 24 of 26
63. (turn_to satellite3 phenomenon26 star29)
   deleted: (pointing satellite3 star29)
   added: (pointing satellite3 phenomenon26)
   goals met: 25 of 26
64. (turn_to satellite3 star9 phenomenon26)
   deleted: (pointing satellite3 phenomenon26)
   added: (pointing satellite3 star9)
   goals met: 24 of 26
65. (take_image satellite3 star9 instrument6 infrared2)
   added: (have_image star9 infrared2)
   goals met: 25 of 26
66. (turn_to satellite3 phenomenon26 star9)
   deleted: (pointing satellite3 star9)
   added: (pointing satellite3 phenomenon26)
   goals met: 26 of 26
